app/controllers/school_classes_controller.rb

	def create
		@school_class = SchoolClass.create(post_params)
---
INSERT INTO "school_classes" ("title", "room_number", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "Comp Sci"], ["room_number", 2], ["created_at", "2020-04-26 16:19:44.227806"], ["updated_at", "2020-04-26 16:19:44.227806"]]

	def update
		@school_class = SchoolClass.find(params[:id])
		@school_class.update(post_params)
---
SELECT  "school_classes".* FROM "school_classes" WHERE "school_classes"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "school_classes" SET "title" = ?, "updated_at" = ? WHERE "school_classes"."id" = ?  [["title", "Homeroom"], ["updated_at", "2020-04-26 16:22:30.537188"], ["id", 1]]