app/controllers/students_controller.rb

	def create
		@student = Student.create(post_params)
---
INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Eliz"], ["last_name", "O"], ["created_at", "2020-04-26 16:09:53.078627"], ["updated_at", "2020-04-26 16:09:53.078627"]]